
int [] = generateArray( int len);
{
    int [] array = new int[len];
for (int i=0; i<len; i++){
    array[i]new Random().Next(-100,100);
}
return array;
}
Console.WriteLine("Введите количество элементов в массиве: ");
int 
/*
Задача 32: Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.
[-4, -8, 8, 2] -> [4, 8, -8, -2] 
*/

