// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");



/*Задача 33: Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.
4; массив [6, 7, 19, 345, 3] -> нет
-3; массив [6, 7, 19, 345, -3] -> да*/